#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "3fd9d8e246da48df265a2b56c6a6a214" -> "c3aac2f0f399ea9ba1215d842802b0bc"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "f98d32ef9e1e209a481def328949afc3" -> "287cc58b447053e94734aceece26227e"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "11f935a16b96181b5f1d60b533a5244e" -> "4cb994550fedd736f94fa6addde5ec93"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8dfbde83d9bf9635cc2193603b784e20" -> "9877bd8a87894b6509baa2413c99c7b2"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "a59a67f4f6b68dc1f16dc51d4d190c73" -> "4666bea2e247f52bfaf4042e7a6defaf"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "dfd74caf97dd029a0271a1d87e0a5334" -> "59a8c5a591876f2651e2debc6b57e2f4"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "cbf1eec6057e6d8b46c230cd1e943655" -> "4ddb497fee037bcab350dd95a49b558c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "87752ff805b25a46eeb2bbc23a8838ca" -> "cca952bb6623a97fb26e9f446279cc70"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f9a2e52a579c7b07c08a12e9a7265d2" -> "ecb324f6fee0b07ab19dc49ff56cb63e"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f45863c38e435d983abec4a4d679a2a8" -> "cd4fe22e68ec9aec4f9d9a961c9ece94"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3f2109d6d262256255a07a6af1de532d" -> "28a108790f4639f79e7fe67769b67e30"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "6e9f730a70967c6322be08b4426a76e1" -> "c9c85bff67b1135cd1e3be633e6727a5"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c167a9068e55f5c918a34a973de0a1ee" -> "c4a3994552c6cc03913714ca2a5df0bb"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "bec63d2b002c7a5d40a5f63854535c1b" -> "6d718b87c85fdad3e0e4badff47edb13"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "c9bb8b943ba0395ac02e8af4007400bb" -> "507c7d159628d3121ae393fe61d7dc08"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "34a83bc43fc9bf85beff704b890b544b" -> "060d7f1220d6973d6da35fd0146d17c5"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f3c9c0f610f9b6930eca6932ac507fde" -> "1cf4c3a79bf996dd9f28a8cd4485dc23"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "95c0c6db0db31b750b5f63a71a1dc0da" -> "5278cb39e3d06975e21be1b8124d6936"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "b85092f35e25bec659083eadbc29afed" -> "48fe95c6bc4167dc26553425d906427d"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "f41897f87448f72dfe418df6dbbbb62c" -> "f1997871235f58a5a29de93292a5d076"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "825ebda657d1f5f435b82b1df4bfb47c" -> "2604672434eaa559b9ddcce10de1b6b8"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "841a340e2969777842f6bcf9ae1909a6" -> "ea9582eaa273506aec54f6f248fb57c4"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "d4dc24a982673669115af458c04db206" -> "f23dccc4d1f85b9440e18cf1e79147bf"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "64f56bb13e451ce4d349bccaf6a996e4" -> "d6d87bd0926cd67ae8f97554fc4866af"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6850a38fab0a26a248459c42e76206ca" -> "1cad1a2a64f9f52fa89d1974506b04fa"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "0ed216389cc49084a9b9926be4cab436" -> "a79689bcee143dd39db6c789662534cd"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "a32a014813b70da72dc073aac79413cc" -> "e7a1f57307f78a7cbf03b25e992caa38"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7e2a84615c2f77e3e20248495aba237a" -> "4a5afd49fc6fce7ab00e9bfda1fbd057"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "4d9002d1db480f54a67e19e3cf69aeec" -> "dd280fccd38da7be65aecc8ab1e77a50"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "048f2fa6c2eaebe03e456125336380da" -> "d1ad0bf2c48a9000d6878c57e7bb4970"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "942c10cc404adb0f22c8cc3fe44dc9bf" -> "f4e80d572b3e0d1563f5fa592db26267"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "97549c484694aa579fe8a864459cec7e" -> "3e4bcb0f9ca8808b9eae6c383129f00a"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e2a5ec3983efa9ac1572e4032263dd77" -> "9f765df2df67692e709eaca3173b0c2b"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6bcacef4498c40b184b74ccda2deaf22" -> "c474bee2bf1a0b6d2171b7d8da0ebd26"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "e88b19c2499f6ef1a97a722c66f83d42" -> "7999588d1a1d6ff1fcca22ea781bc0de"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "d3fa3dd06a94784d79906f688d8c97a1" -> "202263ca79e0140d51155a5ab5e4b266"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "26d5f2876d9575af3dfbe21efb3c6bfb" -> "9772e7050373e249c8b7b5dbbc37150d"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "394bfb21615993dbbae624a27baec5e4" -> "ad03165631867df844e8baebfc9ce2d2"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "eed8fd2ba6e0b0964f5468cd349864a1" -> "1e973ca61ce657c5437f3a48548cc442"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "182e3a90e15667ab0466b3faa8180bf7" -> "7908f84f0a5ac08d16969acb957d6c55"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "270478b4340359e7c2772c85809e55fe" -> "9bba9679c24bec686474cf11332d025a"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "48f99cf2abe811a0a9146c5a4cd59618" -> "0290e7f62c3a70918c46d3efbe1f917b"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4779926d16b7cf2ef5ea6fc6f221d8a6" -> "5de9405490a9ef5982126eacbe8e4206"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.codebuild.aws_codebuild_source_credential.git_credential must be replaced
-/+ resource "aws_codebuild_source_credential" "git_credential" {
      ~ arn         = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ id          = "arn:aws:codebuild:us-west-2:435552912911:token/github" -> (known after apply)
      ~ token       = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGr/mwjOLYX0LQRqh2gNgdS1rB+PQND0Jy15RpC+jc=" -> "LPLx1TraW/YttsPEh5SE1bldc9pbMKJ2Urz57SW2tio="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vs7SjePrS8gY8XSNu+lYHctfGM5sAYDjKdHTRw5ufsM=" -> "aGMuEvWruDyZnT0xKbKC8c8VWv8s5ZWSFJyWKiYjP74="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcF1T8MPsERT7W10lMu5WTVx2BEqNfuIZVNoRwZkvhg=" -> "rG7mIDRXv6C2IjVwVjqujqL/36D9VUlvsPWztyabTXk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6nGKT7DuSNL9X0QvZbGqL6061WKlPFxmqZPSqm3UQ0=" -> "ipsWj6pD8cVFVlYCXZFBecvRyDCr3ipoNKQgJJ9RooQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "gZn3mNzqb+Z2Ulnu/AaH0nd0QhDFANjFDuB3Wkk+SnA=" -> "Y381JSQJb+NQed58u8uCd/pqZJCAzaRMw8Fj9hi63tU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "QBARFicV8aMsMejbusiB9tG4ss0eGJ33eT7u6h6oerc=" -> "u5hcvW7ocHGHILDuTOElILXNK6/hWNl2n280kulSdcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuVHQbNLqw5R0luyu2wMatebbGD8k41A4YiCLoGdIsU=" -> "coqf2FfG1IuVb7Ux0QUfKT36i99jRuO+jjvTOMI//4Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "RjbQ7qmaPGGxzia459HD/nhp6oKglMLdMxVRIiOZm1g=" -> "4e1Xz+nq/SwRfzOzd/oy2jyV+Ny2Sd2fV1FdaKfPCDM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUHMr65V/2Q7ICHoHVWmrmof2r2xrhDscnxG6GjboPs=" -> "poIqLm+0qSaE8ZtWRC1wx0120ftO9QiYpf8QjPnfc9o="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "/5+K7GTvHKWBGKLRKjQF+XA3DPHe6mqPH4lVOkk9Ai8=" -> "D/3EwPgtQwuqBGKt9wEDvd4w/aEscUNMPsqyS3EhecQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "s0s/xS64v+7MfGSHE8NBzVZELpRogJkYgW2Ly3SXaOY=" -> "Gwq3jNcH9B06M4/OD/2FQlbCGNkPSkd8gHRl27SweSg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WvvxCG2MBHXb58Qdjy3O+kB4eV67Dyn2nZAbG/dLjaU=" -> "U3UdknqQpwdQUOzZd3YXR/G7IePetZFtCef7VJ3J41U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "WfSX6RJaW4ENU6xP/P/gpy4yRv6ospmLEqrdJxdxFZI=" -> "hzShXRN0iDOANBQXoFHs2PzU5y90u6V47fXhE5KDHlM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "4AkT9JE2Xe+AMDnHrwdGCddqk9LO+yhLfETqOAqBFV0=" -> "0EH2Oz5KsYTaE8seFoR9YfCC9p2Q1LpVFa0QPnIygrQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "hMSKal/wJ1XwkUbECOGvT56THAbHdXqVO3g8n4ZxNVM=" -> "du3aQOFrJMR208tHWRe5l1nr89Zic4miAWEeqDBJ4gM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cEfGDPexcle4umaBCmkzzvwMPWE5Hxg4m7Ub8tpbM1k=" -> "zeA5HnGnzqLUPs/F3x0pSDDz3UEI4I0/DURJA+Zb3wI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hn9if487roM4UaqV+Atnyxi683F/qi/PC3PFLux90DU=" -> "GFrMt9NPq+T6OHjoszRoyxRJ4DvJl0B6QQCBjRO/4W4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-01T20:43:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "CS/UZkEjhXDDR+YkZmTcn3k0NOLU6Ncp+IZUHMdCYkM=" -> "6OW5gpS7I5tl46zxID9ULP28PtKC2CGwgBd43z4YaUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3Ccu5198aKGRv5n99K6tb51vB6VfGP6r4GPbsqBBhg8=" -> "UaW5RBExDfdE9WKi5ydBnBU9eO11k8fcbW1n3m+YQ5s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "iWRK/WvqG7zteJa3TGBaYf/6Uc/MJDjdONKMUW7UEVg=" -> "0kAby9dDTGK4x2BmgMVWT08guBf5/OE9f1Tvflury/M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3DxJQse/usODcSM62/ng7/NDSTMAXSKE6t8EV84IG7A=" -> "hq5kdJF2Y3Xu4tjz0H4Tygwx+7Xn4pOTEmkx+4GwV4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "nIxmvcsGnEQj/3JikzTho5uvSolB1kgGHBr6vnkvRSk=" -> "OSdSWZalhlWWPXadNLn2F9gCnthorxIaAGnPzVkL45I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "o61Qn/k1HZpmwEXNfVxVVXZ9y5CNoH8+hND8nyR8xIc=" -> "1Mr3PUe7jfPRLaQQsR0rYIjI6YHn1Ebk9T1+ZATfCz0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRg1n9vvr+qzEUyGMLU2DlRWURCVCHQPLLQgKVfefkQ=" -> "rCiCU32QPlkpPj5IOPO+4J2E0JX0vh1MaPlC0jHboSw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "BxE/oLkR7+ssQWkKuoCZhyjdQj2zXHgXHce6vWwcv4k=" -> "b7YY4lR+CI5h5MdalGWKqVL5cWZy9iJiNQQYHfna2h4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "daKXo+d0SnGXXJELltf5+0KF9qu3Pi5xAJyVPrPpy0o=" -> "vDlA1r+QE62MMkIJ6cJJ+5YPCZCLBE5cfJLseOKbIQM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVVP6bbzFbybG/b5c8xfc1Hz10S0mcAFDdybPn3SJU8=" -> "NipZq+OyzV/LWGpBQ14RfJy1mcHKoU5GFlkQ2deVFmc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "FtFycq+75wH7WmejM0EfQg7UuSbTutqXJwsvBl+foKY=" -> "9ke1IeuZtyYEg7FsZM/B4a6lVp/6afbTOLm+A3IMLzA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "DhVn4RBj9XpQ3oHcKcD+yYvhXpDQBRlIBGf2fxWChuY=" -> "wR+COe+pHyoFY/pZASl6+EyBoXcJZjI+EMuunqIm3eg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "8jMpFs8EvfaQMhLwOp/nDbcjT5Bx//4ayLRX5ZpmI2I=" -> "dEOxful2p0exNQYCfpIaOsbYppCRXFlBBXaaYVrsweo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkSUJZg+ARrrCv1yFQ20VJk1pmcxOEb4UOuo3Hyyhc4=" -> "2Ve8wK2q6kAJaetkafA+eKoMxtXWVNmLoAVQEDuQhRs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gDKR3dicxdeoZRaod9aXDiIjmqpD9I2qxiQkn0H82MQ=" -> "8LuAxuhat4fL3X79yr44l3Fjsl+Q/Evshiq2rdnLVxA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYWGtyI5Lqv3jrUzu/sr+7dWU8ZLr5/4KcXrgxV64Iw=" -> "Bg0YFRvzabRBvZt9XjRG2FRFzlYcaAMzJ41w3EEAuzc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "e6eVu1PC03Kv1ti843nF7zO70gQSkgR0LE5s6g3azmU=" -> "8fiAWjhnll4X5qHkv8t5A1lkec7yBoEQHfEwcx4+5CM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "luU1ZGPaN9Hf9KTPtentAC5C9f2eyqaA1kTiN7m9N1s=" -> "3BXjE75rVPgaAIZYFpaZcAwDmB06b7Fti9c5LE61gfM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "j1aYXpmP9J12jikw2d0hF3R4/CC+t42xQ/+spuvQXLI=" -> "xl1gWaUL+9FpYxNgwqDjqYHu99eqR6d7pOUm9comnec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "lE5qhPbfP0aBmYZHtLGUszigfzXAWryafFEU6CZm8eo=" -> "EOpP6oUGDGv61MU5Ia8tgcPa1nGf2qaZkASw6d+z/ms="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "LCDdX0VpXrfCDv7lmh9iFHtr5/18DIrngpiNukwwv18=" -> "lKoKFJ6/Gc5SE+2kjLxpJDl+uWLYXBUtBnwdzOy5gBY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-31T22:48:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RI9iFlD471X1/y3qRpSAHEBTEyTCyVFD9y7ucpdt+2I=" -> "MU/QCqfOhzQ7hYPCUIs7rSadIZgmCSRBibGiGDzSTds="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "j0CwaifjbZS5bozE7Bt01THRus6golSg3MrNam7at6I=" -> "/7dqvELROOcJaTAICBVPOTT0YZikUuIcoJJKPkk+fYs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "gsZVR5KW35jFJMuJtHrW6fKkct6IQRmQNl/taBmM2LQ=" -> "3yy78eBqAFQSWn2kY2KrOqwmmPzK/Kggghj+HBzlLCw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-31T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "7MuPFDFN6Ic8GPoxF88DfO9O1To1XufVVd3FV55Ld8k=" -> "XdujGHTKfgoR4wRWNtBWtgWFEg/H7Vd+PvrT+8nx3Uw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-31T22:46:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xy4ll8" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-31T22:46:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-31T22:49:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 87 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*